results/results_m5_large/results_m5_large_run2/oltp_read_write_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 32.99 qps: 663.36 (r/w/o: 465.00/38.49/159.87) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 36.50 qps: 730.92 (r/w/o: 511.61/43.40/175.90) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 36.80 qps: 735.10 (r/w/o: 514.60/43.10/177.40) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 33.60 qps: 671.60 (r/w/o: 470.00/39.80/161.80) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 26.80 qps: 535.70 (r/w/o: 374.90/31.70/129.10) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 33.30 qps: 667.20 (r/w/o: 467.40/39.20/160.60) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 36.00 qps: 717.40 (r/w/o: 501.40/44.20/171.80) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 34.80 qps: 696.40 (r/w/o: 487.60/40.80/168.00) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 31.10 qps: 624.10 (r/w/o: 437.50/36.40/150.20) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 17.60 qps: 352.50 (r/w/o: 246.60/20.40/85.50) lat (ms,95%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 34.80 qps: 696.10 (r/w/o: 487.30/41.30/167.50) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 34.40 qps: 687.30 (r/w/o: 481.20/41.60/164.50) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            54474
        write:                           4608
        other:                           18738
        total:                           77820
    transactions:                        3891   (32.35 per sec.)
    queries:                             77820  (647.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      32.3531
    time elapsed:                        120.2668s
    total number of events:              3891

Latency (ms):
         min:                                   62.57
         avg:                                  123.57
         max:                                  797.71
         95th percentile:                      215.44
         sum:                               480796.32

Threads fairness:
    events (avg/stddev):           972.7500/7.50
    execution time (avg/stddev):   120.1991/0.04